{
  "title": "A Season at Home",
  "subtitle": "The Joy of Fully Sharing Your Child's Critical Years",
  "isFeatured": false,
  "isCaregivers": false,
  "publishDate": "1993-01-01",
  "coverImageUrl": "/img/book-covers/a-season-at-home.jpg",
  "detailHeaderImageUrl": "/img/book-headers/clouds.jpg",
  "quoteText": "Love begins by taking care of the closest ones—the ones at home",
  "quoteSource": "Mother Teresa",
  "quoteColWidth": 7,
  "contentSections": [
    {
      "name": "Description",
      "content": [
        {
          "type": "html",
          "lines": [
            "<p class='lead'><em>A Season at Home</em> has been out of print for many years now. I wrote it as a young, stay-at-home mom, partly to defend, and partly to advocate for, the choice to be a full-time mom. The book opens with my recollection of a visit from a good friend who came to see me a few months after my son was born:</p>",
            "<p class='ps-4'>She was a career woman, married, and childless by choice. We'd had a lot in common during our mutually childless years and had spent a fair amount of time together. But now, as we sat talking in my home, there seemed to be an odd hint of distance forming between us. It felt uncomfortable, yet it seemed unavoidable: a new chapter in my life had begun. &hellip; We chatted for a while, but as the conversation dwindled, she finally asked, &ldquo;Uh, what do you <em>do</em> all day?&rdquo;</p>",
            "<p class='ps-4'>That's when I first felt <em>those</em> feelings. Maybe you've felt them too: The sudden depletion of self-esteem. The urge to apologize for being at home. The desire to defend mothers at home (knowing in your heart that it's a great choice) but not knowing what to say or where to begin.</p>",
            "<p class='ps-4'>I certainly didn't realize it at the time, but I think the day my friend came to visit was the day this book began.</p>",
            "<p>Recently, my college roommate, Dee, reached out to tell me that her daughter, a teacher with four young kids, wanted to read this book. I wondered if the book, published in 1993, would even still be relevant. Turns out that the answer is yes. While the statistics and details are way out of date, the heart of the book still resonates with young moms who want to experience &ldquo;the joy of fully sharing (their) child's critical years.&rdquo;</p>",
            "<p>After Dee's daughter, Krystan, read the book I received a three-page, handwritten letter from her. Here are some excerpts:</p>",
            "<p class='ps-4'><em>It's amazing how applicable your book still is thirty years later. &hellip; When (my husband and I) realized that as a 7th year teacher, (after paying for) preschool, daycare, and after school care, I was bringing home $400 a month. &hellip; And while teaching allowed me what I felt was the best of both worlds, I realized I was physically there, but mentally and emotionally and spiritually I was pouring from an empty cup. I was emotionally draining myself&hellip;all while my kids suffered. For what end? To what purpose? And then it clicked. &hellip; I am so temporary and replaceable as a teacher. But as a mother, as a wife, as the keeper of emotional stability for my family, there I am irreplaceable. So I did what no teacher wants to do. I quit&hellip;  </em></p>",
            "<p class='ps-4'><em>In a broken world where we are seeing such an attack on the family, I chose family. And I don't regret it a bit. Your book reminded me that I am not alone in not being able to juggle it all, in feeling like I was failing everything, resenting all that life was holding me responsible for. Your book affirmed that my choice to give my children all of my emotional energy was courageous and will bear fruit. You are a part of my journey now and for that I thank you!</em></p>",
            "<p>Krystan's words are a sweet reminder that even out-of-date, out-of-print books can still impact lives. </p>"
          ]
        }
      ]
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Amazon <small>(Buy it Used)</small>",
          "url": "https://www.amazon.com/Season-Home-Sharing-Childs-Critical/dp/0310481015"
        }
      ]
    }
  ]
}
