{
  "title": "Caregiving",
  "subtitle": "Taking Care of Yourself While Caring for Someone Else",
  "isFeatured": true,
  "isCaregivers": true,
  "publishDate": "2024-03-19",
  "coverImageUrl": "/img/book-covers/caregiving.jpg",
  "detailHeaderImageUrl": "/img/book-headers/clouds.jpg",
  "quoteText": "",
  "quoteSource": "",
  "contentSections": [
    {
      "name": "Description",
      "content": [
        {
          "type": "html",
          "lines": [
            "<p class='lead'>Caregiving is never just about the person needing care. No matter who a person is caring for, or why, or for how long, the caregiving journey is <em>always</em> also about the caregiver. Yet, while most caregivers do a spectacular job of taking care of their loved one, far too many are challenged in the area of self care.</p>",
            "<p>Well-meaning caregivers sometimes sacrifice their own physical, emotional, social, and other needs so they can pour all their energy and devote all their time to the person in their care. While that sounds noble and loving, it's really not. It actually puts the cared-for person at risk. This book challenges caregivers to rethink the importance of self-care, telling them: </p>",
            "<p class='ps-4'>Here's the truth. If you ignore your own needs for restful sleep, healthy food, exercise, medical care, spiritual nurture, and &ldquo;time off,&rdquo; sooner or later, you will be <em>unable</em> to go on meeting the needs of the person in your care. Unless you make caring for yourself a top priority, you may burn out or bail out. And where would that leave the person you're caring for?</p>",
            "<p class='ps-4'>Self-care is what will enable you to endure the challenges of long-haul caregiving. It keeps your emotional, spiritual, and physical reserves from running out. It equips you to be the patient, loving, and truly <em>caring</em> caregiver you want to be.</p>",
            "<p>The key message of the book is this: caregiver self-care isn't selfish; it's an investment that will be repaid in a better quality of life for the caregiver and a better quality of care for their loved one. Caregiver self-care isn't just smart—it's necessary!</p>"
          ]
        }
      ]
    },
    {
      "name": "Comments And Reviews",
      "content": [
        {
          "type": "quote",
          "text": "As the caregiver of a husband who had dementia, I wish this book had been available at the beginning of my journey. Debbie helps you understand all aspects of caregiving and what a difficult journey it is as well as the rewarding side. She gives you resources to help you as well as tips to ease the hardship of caregiving. I especially learned a lot about the word “hesed” and how this “choice driven love” enabled me to love and serve the one in my care even when there was no acknowledgment or thanks for all I did.",
          "source": "Linda",
          "citation": "former spouse caregiver"
        },
        {
          "type": "quote",
          "text": "I believe one of the hardest parts of caregiving is looking after oneself. Caregiving brings honest engagement with the challenges and blessings of providing care. The easy reading style, use of true stories and concise length make it accessible to all. However, I most appreciated its pithy practical proposals for how to keep caring by practicing self-care. I will be recommending and stocking my bookshelf with copies of this book to give to people.",
          "source": "Ben",
          "citation": "chaplain"
        },
        {
          "type": "quote",
          "text": "If you need a brand new outlook and refreshing ideas that will encourage and enlighten you when you have the job of giving care to someone who depends entirely upon you, this book will meet your expectations and then some. The author has brought to light so many good facts about the need for caregivers to take care of themselves and those facts should not and cannot be ignored by caregivers. And it is not all facts and figures. There are also real life stories from caregivers that have found ways to take care of themselves while caregiving; and through it all, showing extraordinary love to the person in their care. <br><br> I have been a caregiver for two members of my immediate family at separate times during my adult life. Little did I know this was going to take up many years of my life. This book is a &quot;must read&quot; for caregivers and I will re-read it many times as I continue with my caregiving journey. Thank you Debbie Barr for encouraging me and others like me to realize how important a job we have serving others, and that in order to do that well we must take care of ourselves.",
          "source": "Staples",
          "citation": "family caregiver"
        }
      ]
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Aspire Press",
          "url": "https://www.hendricksonrose.com/p/caregiving/9781496483515"
        },
        {
          "name": "Barnes & Noble",
          "url": "https://www.barnesandnoble.com/w/caregiving-debbie-barr/1143681789?ean=9781496483515"
        },
        {
          "name": "Get it Local ",
          "url": "https://getitlocaltoday.com/product/9781496483515"
        },
        {
          "name": "Walmart",
          "url": "https://www.walmart.com/ip/Hope-and-Healing-Caregiving-Taking-Care-of-Yourself-While-Caring-for-Someone-Else-Paperback-9781496483515/3719053510?from=/search"
        },
        {
          "name": "Parable",
          "url": "https://parable.com/product/9781496483515"
        },
        {
          "name": "Amazon",
          "url": "https://www.amazon.com/Caregiving-Taking-Yourself-Someone-Healing/dp/1496483510"
        },
        {
          "name": "ChristianBook",
          "url": "https://www.christianbook.com/caregiving/9781496483515/pd/483515?event=ESRCG"
        }
      ]
    },
    {
      "type": "Ebook",
      "links": [
        {
          "name": "Kindle",
          "url": "https://www.amazon.com/Caregiving-Taking-Yourself-Someone-Healing-ebook/dp/B0CGMLMSKF"
        },
        {
          "name": "Nook",
          "url": "https://www.barnesandnoble.com/w/forgiveness-debbie-barr/1143681798?ean=9781496483584"
        },
        {
          "name": "ChristianBook <small>(PDF)</small>",
          "url": "https://www.christianbook.com/caregiving-taking-yourself-while-caring-someone/9781496483553/pd/35150DF?event=ESRCG"
        },
        {
          "name": "ChristianBook <small>(ePub)</small>",
          "url": "https://www.christianbook.com/caregiving-taking-yourself-caring-someone-ebook/9781496483539/pd/126461EB?event=AAI"
        }
      ]
    }
  ]
}
