{
  "title": "Forgiveness",
  "subtitle": "The Choice that Sets You Free",
  "isFeatured": true,
  "isCaregivers": false,
  "publishDate": "2024-03-19",
  "coverImageUrl": "/img/book-covers/forgiveness.jpg",
  "detailHeaderImageUrl": "/img/book-headers/clouds.jpg",
  "quoteText": "Words which do not give the light of Christ increase the darkness.",
  "quoteSource": "Mother Teresa",
  "quoteColWidth": 7,
  "contentSections": [
    {
      "name": "Description",
      "content": [
        {
          "type": "html",
          "lines": [
            "<p class='lead'>Forgiving others is sometimes easy—<em>you stepped on my toe. No big deal</em>. But if you have been deliberately insulted, betrayed, or violated in some painful, life-altering way, forgiveness can be very, very difficult. The more outrageous the offense, the harder it can be to forgive:</p>",
            "<p class='ps-4'>",
            "  <em>How can you forgive a painful offense you cannot stop thinking about?</em><br>",
            "  <em>Should you forgive someone who doesn't ask for your forgiveness?</em><br>",
            "  <em>Why forgive someone who doesn't even care that you were hurt by what they did?</em>",
            "</p>",
            "<p>This book helps answer those questions by delving into the reasons why God wants us to forgive.</p>",
            "<p>Many people don't realize that forgiveness is <em>for us</em>— for our peace of mind and heart, for our happiness, and for our spiritual and emotional freedom from the toxic effects of resentment and unforgiveness. This is where the book title comes from: forgiveness is <em>the choice that sets you free</em>. Releasing others through forgiveness actually benefits the forgiver in amazing ways. Even more amazing is the mysterious fact that God can bring something good out of even our most painful offenses.</p>",
            "<p>I learned so much in the process of researching and writing this book. One of my biggest personal takeaways is the fact that there are two kinds of forgiveness: transactional forgiveness and unilateral forgiveness. Transactional forgiveness is the kind of forgiveness that reconciles relationships. It's <em>inter</em>personal; it involves both the offended person and the offending person. The other kind of forgiveness, unilateral forgiveness, is <em>intra</em>personal. It takes place entirely within the mind and heart of the offended person. The offending person is not even involved. Surprised? I sure was! In this book, you may just discover, as I did, that there is more to forgiveness than you thought!</p>"
          ]
        }
      ]
    },
    {
      "name": "Comments And Reviews",
      "content": [
        {
          "type": "quote",
          "text": "Reading <em>Forgiveness: The Choice That Sets You Free</em> led me on an eye-opening journey of discovery and personal reflection. I always knew that as a Christian God was calling me to walk in the way of forgiveness. What I never considered were the many aspects of forgiveness which might challenge my obedience to God's call. <br><br> I found this book to be practical and highly motivating! Debbie Barr presents a wealth of information surrounding the varied opportunities life may present which could challenge the choice to forgive. Her stories from real-life situations add interest and further clarify the personal benefits possible for the forgiver. In addition, the excellent bridge to the Christian gospel adds the spiritual dimension and encouragement from which the Holy Spirit may spark within the reader a desire and willingness to make the choice and extend forgiveness, even in the midst of challenges. <br><br> I highly recommend this book! It has helped me take a look at my own life and consider where I still need to forgive. I look forward to sharing a copy with those the Lord brings across my path who are struggling with forgiveness and need encouragement to move forward in it so they can be set free!",
          "source": "Bev D."
        },
        {
          "type": "quote",
          "text": "This book is so well organized—all the communication features, stories, truths, examples, diagrams, steps to do. Thanks, Debbie! I love the points about forgiveness and what it does <em>not</em> mean. The section on &ldquo;when forgiveness is withheld&rdquo; connected with a deep set of hurts I have inside with a couple of my children taking offense over something years ago and not giving forgiveness to me even when I have persisted in asking.",
          "source": "Florida Dad"
        },
        {
          "type": "quote",
          "text": "This empathetic book lists practical steps to understand what forgiveness is (and isn't). Stories of those who have found freedom will give readers hope of overcoming life's deepest pains.",
          "source": "Deborah P."
        }
      ]
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Aspire Press",
          "url": "https://www.hendricksonrose.com/p/forgiveness/9781496483560"
        },
        {
          "name": "Amazon",
          "url": "https://www.amazon.com/Forgiveness-Choice-that-Sets-Healing/dp/1496483561"
        },
        {
          "name": "Barnes & Noble",
          "url": "https://www.barnesandnoble.com/w/forgiveness-debbie-barr/1143681798?ean=9781496483560"
        },
        {
          "name": "Get it Local",
          "url": "https://getitlocaltoday.com/product/9781496483560"
        },
        {
          "name": "Walmart",
          "url": "https://www.walmart.com/search/?q=9781496483560"
        },
        {
          "name": "Parable",
          "url": "https://parable.com/product/9781496483560"
        },
        {
          "name": "ChristianBook",
          "url": "https://www.christianbook.com/forgiveness/9781496483560/pd/483562?event=AAI"
        }
      ]
    },
    {
      "type": "Ebook",
      "links": [
        {
          "name": "Kindle",
          "url": "https://www.amazon.com/Forgiveness-Choice-that-Sets-Healing-ebook/dp/B0CGMM3XV8"
        },
        {
          "name": "Nook",
          "url": "https://www.barnesandnoble.com/w/forgiveness-debbie-barr/1143681798?ean=9781496483584"
        },
        {
          "name": "ChristianBook <small>(ePub)</small>",
          "url": "https://www.christianbook.com/forgiveness-choice-that-sets-free-ebook/9781496483584/pd/126462EB?event=AAI"
        },
        {
          "name": "ChristianBook <small>(PDF)</small>",
          "url": "https://www.christianbook.com/forgiveness-choice-that-sets-free-pdf/9781496483607/pd/35151DF?event=AAI"
        }
      ]
    }
  ]
}
