{
  "title": "Overwhelmed",
  "subtitle": "How to Stop Trying to Do It All",
  "isFeatured": true,
  "isCaregivers": false,
  "publishDate": "2024-03-19",
  "coverImageUrl": "/img/book-covers/overwhelmed.jpg",
  "detailHeaderImageUrl": "/img/book-headers/clouds.jpg",
  "quoteText": "",
  "quoteSource": "",
  "contentSections": [
    {
      "name": "Description",
      "content": [
        {
          "type": "html",
          "lines": [
            "<p class='lead'>When I proposed the idea for this book, I had no way of knowing that I would ironically find myself writing <em>Overwhelmed</em> in the midst of one of the most overwhelming times of my life.</p>",
            "<p>I will spare you the details, except to say that my full-time job responsibilities, the unexpected serious illness of a family member for whom I serve as Power of Attorney, and the task of researching and writing a book collided in such a way that, for a period of months, I felt&hellip; overwhelmed. Sometimes I felt both mentally and physically exhausted. And sometimes I had to dig very deep to find the perseverance to continue to meet my trifecta of concurrent responsibilities.</p>",
            "<p>In time, it all resolved: my job ended, my family member 's health improved, the book was finished, and I no longer felt overwhelmed. Looking back, I realize that in the providence of God's perfect timing, because I wrote this book while temporarily overwhelmed myself, it may be a more authentic book than I could otherwise have written. Because of my own experience, I now have much greater empathy for those in overwhelming circumstances. And, while life on planet earth has always been somewhat overwhelming, I now recognize why, in the modern era, we are more likely to be chronically overwhelmed than those in generations past.</p>",
            "<p>Though times have dramatically changed and the speed of life has dramatically increased, God has never changed. He is as he has always been: &ldquo;<em>&hellip;the same yesterday and today and forever</em>&rdquo; (Hebrews 13:8). Because we are more vulnerable to being overwhelmed than any generation that has lived before us, we need to abide more deeply in the Shalom of God than any other generation has ever done. That's the deeply heartfelt message of my book, <em>Overwhelmed</em>.</p>",
            "<p class='text-center'>&ldquo;<em>When I am overwhelmed, you alone know the way I should turn.</em>&rdquo; - Psalm 142:3 (NLT)</p>"
          ]
        }
      ]
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Amazon",
          "url": "https://www.amazon.com/Overwhelmed-Stop-Trying-Hope-Healing/dp/1496483669"
        },
        {
          "name": "Aspire Press",
          "url": "https://www.hendricksonrose.com/p/overwhelmed/9781496483669"
        },
        {
          "name": "Barnes &amp; Noble",
          "url": "https://www.barnesandnoble.com/w/overwhelmed-debbie-barr/1145003274?ean=9781496483669"
        }
      ]
    },
    {
      "type": "Ebook",
      "links": [
        {
          "name": "Kindle",
          "url": "https://www.amazon.com/Overwhelmed-Stop-Trying-Hope-Healing-ebook/dp/B0CWZCTFJH"
        },
        {
          "name": "Aspire Press <small>(PDF)</small>",
          "url": "https://www.hendricksonrose.com/p/overwhelmed/9781496483706"
        },
        {
          "name": "Nook",
          "url": "https://www.barnesandnoble.com/w/overwhelmed-debbie-barr/1145003274?ean=9781496483683"
        }
      ]
    }
  ]
}
