{
  "title": "Strength For The Cancer Journey",
  "subtitle": "30 Days of Inspiration, Encouragement, and Comfort",
  "isFeatured": false,
  "isCaregivers": false,
  "publishDate": "2020-01-01",
  "coverImageUrl": "/img/book-covers/strength-for-the-cancer-journey.png",
  "detailHeaderImageUrl": "",
  "quoteText": "I shall keep my book on the table here, and read a little every morning as soon as I wake, for I know it will do me good, and help me through the day.",
  "quoteSource": "Louisa May Alcott",
  "description": [
    "This year, and every year, millions of Americans will hear a doctor say three words they never wanted to hear: \"<em>You have cancer.</em>\" These life-altering words will usher them into what one man calls \"<em>the club that nobody wants to be a member of.</em>\" ",
    "If you are a reluctant member of that \"club,\" I want you to know that <em>Strength for the Cancer Journey</em> was written for you. I wrote it because, ultimately, there are really only two ways to journey through cancer: in your own strength, or with the help and strength that God supplies.",
    "<em>Strength for the Cancer Journey</em> provides empathetic daily reminders that God is a very present source of strength for anyone facing the challenges of cancer. Its 30 devotionals draw upon the personal experiences and insights of actual cancer patients—my eight-member \"panel of experts.\" In each daily reading, their stories. along with Scriptural truths, help readers invite God into the realities, uncertainties, and frustrations of their own personal experience of cancer.",
    "While cancer is a journey no one wants to take, no one ever has to walk that road alone!",
    "<em>Strength for the Cancer Journey</em> is a book for both patients and caregivers who want to engage deeply with God, looking to Him for daily strength for their cancer journey."
  ],
  "commentsAndReviews": [
    {
      "text": "I'm a 16-year survivor of an incurable cancer: multiple myeloma. As a cancer patient and author, I have deeply appreciated this devotional by Debbie Barr. She normalizes the unique feelings we have when fighting our disease. At times, I could feel her walking alongside, reminding me I am not alone, others have been where I am... and more importantly, the Lord is with me.",
      "source": "Maggie Bruehl, author of Suspended: Living with Dying"
    },
    {
      "text": "If you know of someone who has cancer, Strength for the Cancer Journey, will be a welcomed gift. I would encourage churches to give this book to every member who is diagnosed with cancer. It is a wonderful way of expressing love and care for anyone who is on the \"cancer journey.\"",
      "source": "Gary Chapman, Ph.D. author of The 5 Love Languages"
    },
    {
      "text": "This book was given to me anonymously by someone aware of my cancer diagnosis. I would love to thank them for doing so. This book has brought me such comfort during this very difficult time. Anyone who knows someone with cancer should share this book with them. They will be eternally grateful as I am. ",
      "source": "Goodreads Review"
    },
    {
      "text": "I sent this book to a friend who has breast cancer. She wrote this note back to me: \"<em>I’ve just finished Day 2 of the Strength for the Cancer Journey book. Thank you so much for sending it to me. The very first devotional hit me right between the eyes. My hard-headed German heritage has served me well during difficult times in the past. But this journey has taken me by surprise in that almost for the first time in my life, I have felt like this is something I cannot handle. So it's up to God to handle it for me.</em>\"",
      "source": "Amazon Review"
    },
    {
      "text": "This little book, written by those who have been on this journey themselves, resonates with understanding. A dear friend sent me a copy of this book, and I'm so glad she did! It has been a source of great comfort to me. If you are on a cancer journey, or know someone who is, I highly recommend this book!",
      "source": "Goodreads Review"
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Amazon",
          "url": "#"
        },
        {
          "name": "Barnes & Noble",
          "url": "#"
        },
        {
          "name": "Books-A-Million",
          "url": "#"
        },
        {
          "name": "Moody Publishing",
          "url": "#"
        }
      ]
    },
    {
      "type": "Ebook",
      "links": [
        {
          "name": "Kindle",
          "url": "#"
        },
        {
          "name": "Nook",
          "url": "#"
        },
        {
          "name": "Google",
          "url": "#"
        },
        {
          "name": "Apple",
          "url": "#"
        }
      ]
    },
    {
      "type": "AudioBook",
      "links": [
        {
          "name": "Audible",
          "url": "#"
        },
        {
          "name": "Google",
          "url": "#"
        },
        {
          "name": "Apple",
          "url": "#"
        }
      ]
    }
  ]
}
