{
  "title": "The Mystery of Waiting",
  "subtitle": "How God Works While We Wait",
  "isFeatured": true,
  "isCaregivers": false,
  "publishDate": "2024-03-19",
  "coverImageUrl": "/img/book-covers/the-mystery-of-waiting.jpg",
  "detailHeaderImageUrl": "/img/book-headers/clouds.jpg",
  "quoteText": "",
  "quoteSource": "",
  "contentSections": [
    {
      "name": "Description",
      "content": [
        {
          "type": "html",
          "lines": [
            "<p class='lead'>Waiting is hard. </p>",
            "<p>No one likes to wait. When we are stuck in a traffic jam or standing in a long line at the grocery store or watching the seconds tick by when our phone call is placed on hold, waiting feels like a huge waste of our time. As much as we dislike waiting, it's apparent that God is quite fond of waiting! After all, he set the pace of the world we live in.</p>",
            "<p>God's timing is always perfect, never too early and never too late, so he wants us to allow his perfect timing to guide our lives. Yet, when he wisely pushes the pause button to pace us, so that things happen for us at the right time, we so often misunderstand, resist, and forge ahead. It's hard for us to accept that anything that slows us down could actually be positioning us to receive a blessing, right on time. </p>",
            "<p>In the book, I shared six reasons why God may sometimes make us wait for his answers. But before I delved into those reasons, I felt compelled to first say that though waiting can be frustrating, disappointing, and irritating, God is never playing with our lives. Lamentations 3:33 assures us that God &ldquo;<em>takes no pleasure in&hellip;throwing roadblocks in the way</em>&rdquo; (The Message). In other words, whenever God makes us wait for his answer, we can be certain that because of his strong love for us, there is a wise purpose for the wait. Our faith challenge is to trust that God is, in fact, delaying in order to ultimately do what's best for us. </p>",
            "<p>Isaiah 64:4 plainly tells us that God &ldquo;<em>&hellip;works for those who wait for him.</em>&rdquo; That's why waiting on God is never a waste of time. As long as we're still waiting, God is still working, and always for our good. When we wait on God, it proves that we really trust him.</p>"
          ]
        }
      ]
    }
  ],
  "linkCategories": [
    {
      "type": "Paperback",
      "links": [
        {
          "name": "Amazon",
          "url": "https://www.amazon.com/Mystery-Waiting-Works-While-Healing/dp/1496483618"
        },
        {
          "name": "Aspire Press",
          "url": "https://www.hendricksonrose.com/p/the-mystery-of-waiting/9781496483614"
        },
        {
          "name": "Barnes &amp; Noble",
          "url": "https://www.barnesandnoble.com/w/the-mystery-of-waiting-debbie-barr/1145003275?ean=9781496483614"
        }
      ]
    },
    {
      "type": "Ebook",
      "links": [
        {
          "name": "Kindle",
          "url": "https://www.amazon.com/Mystery-Waiting-Works-While-Healing-ebook/dp/B0CW1LP4RW/"
        },
        {
          "name": "Aspire Press <small>(PDF)</small>",
          "url": "https://www.hendricksonrose.com/p/the-mystery-of-waiting/9781496483652"
        },
        {
          "name": "Nook",
          "url": "https://www.barnesandnoble.com/w/the-mystery-of-waiting-debbie-barr/1145003275?ean=9781496483638"
        }
      ]
    }
  ]
}
